---
kind: property
id: P:Autodesk.Revit.DB.DocumentDifference.AreDeletedElementIdsAvailable
source: html/03599d71-84de-97f3-8fcd-10a5d11a0910.htm
---
# Autodesk.Revit.DB.DocumentDifference.AreDeletedElementIdsAvailable Property

Whether or the deleted elements were retrieved.

## Syntax (C#)
```csharp
public bool AreDeletedElementIdsAvailable { get; }
```